АлогистикТест2/src/Documents/алк_УпаковкаНоменклатуры/алк_УпаковкаНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>алк_УпаковкаНоменклатуры</name>
  <registerRecords>AccumulationRegister.алк_ЗапасыКПоступлениюНаСкладыСерии</registerRecords>
  <registerRecords>AccumulationRegister.алк_ЗапасыОрганизации</registerRecords>
  <registerRecords>AccumulationRegister.алк_ОстаткиЗапасов</registerRecords>
  <registerRecords>AccumulationRegister.алк_ПроизводствоОборот</registerRecords>
  <registerRecords>InformationRegister.алк_ПакетыИсторияЗаказов</registerRecords>
  <registerRecords>InformationRegister.СерийныеНомераГарантии</registerRecords>
  <registerRecords>InformationRegister.алк_ПараметрыПакетов</registerRecords>
  <attributes>
    <name>ДатаСмены</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.алк_РасформированиеПакетов</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Направление</name>
    <type>
      <types>EnumRef.алк_НаправленияДеятельности</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Сертификат</name>
    <type>
      <types>CatalogRef.СертификатыНаПродукцию</types>
    </type>
  </attributes>
  <attributes>
    <name>Смена</name>
    <type>
      <types>CatalogRef.алк_Смены</types>
    </type>
  </attributes>
  <attributes>
    <name>СменаУдалить</name>
    <type>
      <types>EnumRef.Смены</types>
    </type>
  </attributes>
  <attributes>
    <name>СтруктурнаяЕдиницаЗапасов</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>СтруктурнаяЕдиницаПродукции</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>Участок</name>
    <type>
      <types>CatalogRef.алк_Участки</types>
    </type>
  </attributes>
  <attributes>
    <name>ЯчейкаЗапасов</name>
    <type>
      <types>CatalogRef.Ячейки</types>
    </type>
  </attributes>
  <attributes>
    <name>ЯчейкаПродукции</name>
    <type>
      <types>CatalogRef.Ячейки</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Продукция</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.КлассификаторЕдиницИзмерения</types>
        <types>CatalogRef.ЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЭтоРазделитель</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>СерийныеНомера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КлючСвязи</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗаказНаПроизводство</name>
      <type>
        <types>DocumentRef.алк_ЗаказНаПроизводство</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗаказПокупателя</name>
      <type>
        <types>DocumentRef.алк_ЗаказПокупателя</types>
      </type>
    </attributes>
    <attributes>
      <name>Продукция</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КатегорияНоменклатурыПЭО</name>
      <type>
        <types>CatalogRef.алк_КатегорияНоменклатурыПЭО</types>
      </type>
    </attributes>
    <attributes>
      <name>Припуск</name>
      <type>
        <types>CatalogRef.алк_ВариантыПрипуска</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СерийныеНомераПродукция</name>
    <attributes>
      <name>СерийныйНомер</name>
      <type>
        <types>CatalogRef.СерийныеНомера</types>
      </type>
    </attributes>
    <attributes>
      <name>КлючСвязи</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПродукцияПФ</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

АлогистикТест2/src/AccumulationRegisters/алк_ОстаткиЗапасов/алк_ОстаткиЗапасов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>алк_ОстаткиЗапасов</name>
  <resources>
    <name>Количество</name>
    <comment>Для пиловочника и пилмата это объем, для ДГ это вес</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтруктурнаяЕдиница</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Штабель</name>
    <type>
      <types>CatalogRef.алк_Штабели</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сертификат</name>
    <type>
      <types>CatalogRef.СертификатыНаПродукцию</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СерийныйНомер</name>
    <type>
      <types>CatalogRef.СерийныеНомера</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

АлогистикТест2/src/InformationRegisters/алк_ДополнительныеПараметрыПакетов/алк_ДополнительныеПараметрыПакетов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>алк_ДополнительныеПараметрыПакетов</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>ВидШпона</name>
    <type>
      <types>EnumRef.алк_ВидыШпона</types>
    </type>
  </resources>
  <resources>
    <name>Припуск</name>
    <type>
      <types>CatalogRef.алк_ВариантыПрипуска</types>
    </type>
  </resources>
  <resources>
    <name>СлойДревесины</name>
    <type>
      <types>EnumRef.алк_СлойДревесины</types>
    </type>
  </resources>
  <resources>
    <name>СортированныйПакет</name>
    <comment>из какого пакета была упаковка</comment>
    <type>
      <types>CatalogRef.СерийныеНомера</types>
    </type>
  </resources>
  <resources>
    <name>УчастокВыпуска</name>
    <type>
      <types>CatalogRef.алк_Участки</types>
    </type>
  </resources>
  <resources>
    <name>Досушка</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Переупаковка</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>БоковаяДоска</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>КатегорияНоменклатурыПЭО</name>
    <type>
      <types>CatalogRef.алк_КатегорияНоменклатурыПЭО</types>
    </type>
  </resources>
  <resources>
    <name>Габарит</name>
    <type>
      <types>EnumRef.алк_ГабаритПакета</types>
    </type>
  </resources>
  <attributes>
    <name>Документ</name>
    <type>
      <types>DocumentRef.алк_УпаковкаНоменклатуры</types>
      <types>DocumentRef.алк_РучноеИзменениеДополнительныхПараметровПакета</types>
      <types>DocumentRef.алк_РучноеИзменениеПараметровПакета</types>
      <types>DocumentRef.алк_СборкаЗапасов</types>
      <types>DocumentRef.алк_Производство</types>
    </type>
  </attributes>
  <dimensions>
    <name>СерийныйНомер</name>
    <type>
      <types>CatalogRef.СерийныеНомера</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

АлогистикТест2/src/Documents/алк_УпаковкаНоменклатуры/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
	#Область ОбработчикиСобытий
	
	Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
		
		
		
	КонецПроцедуры
	
	Процедура ОбработкаПроведения(Отказ, РежимПроведения)
		
		Если ОбменДанными.Загрузка = Истина Тогда
			Возврат;
		КонецЕсли;
		
		// Инициализация дополнительных свойств для проведения документа
		УправлениеНебольшойФирмойСервер.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства);
		
		Документы.алк_УпаковкаНоменклатуры.ИнициализироватьДанныеДокумента(Ссылка, ДополнительныеСвойства);
		
		// Подготовка наборов записей
		УправлениеНебольшойФирмойСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
		
		// Отражение в разделах учета
		РфпСервер.ОтразитьПараметрыПакетов(ДополнительныеСвойства, Движения, Отказ);
		РфпСервер.ОтразитьЗапасыКПоступлениюНаСкладыСерии(ДополнительныеСвойства, Движения, Отказ);
		РфпСервер.ОтразитьДополнительныеПараметрыПакетов(ДополнительныеСвойства, Движения, Отказ);
		//РфпСервер.ОтразитьВыпускПродукцииСерии(ДополнительныеСвойства, Движения, Отказ);
		Если Дата >= Константы.алк_ДатаНачалаДвиженийПоЗапасамОрганизации.Получить() Тогда
			РфпСервер.ОтразитьЗапасыОрганизации(ДополнительныеСвойства, Движения, Отказ);		
		КонецЕсли;

		// СерийныеНомера
		УправлениеНебольшойФирмойСервер.ОтразитьСерийныеНомераГарантии(ДополнительныеСвойства, Движения, Отказ);
		//РфпСервер.ОтразитьПакетыИсторияЗаказов(ДополнительныеСвойства, Движения, Отказ);   
		
		
		ЗаписыватьДвиженияВНовыеРегистры = РФП_ПроведениеДокументовСервер.ЗаписыватьДвиженияВНовыеРегистры(Дата);
		
		Если ЗаписыватьДвиженияВНовыеРегистры Тогда 
			РфпСервер.ОтразитьПроизводствоОборот(ДополнительныеСвойства, Движения, Отказ);
			РфпСервер.ОтразитьОстаткиЗапасов(ДополнительныеСвойства, Движения, Отказ);
		КонецЕсли;
			
		
		// Запись наборов записей
		УправлениеНебольшойФирмойСервер.ЗаписатьНаборыЗаписей(ЭтотОбъект);
		
		// Контроль
		ОтказПоДублям = КонтрольДублей(РежимПроведения, ДополнительныеСвойства);
		
		Отказ = ОтказПоДублям;  
		
		// Контроль остатков
		Если ЗаписыватьДвиженияВНовыеРегистры Тогда
			Движения.алк_ОстаткиЗапасов.Записать(); 
			РфпСервер.ВыполнитьКонтрольОстатков(ДополнительныеСвойства, "алк_ОстаткиЗапасов", Отказ);  
		КонецЕсли;
		
		ДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц.Закрыть(); 
		
	КонецПроцедуры
	
	Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
		
		Если ОбменДанными.Загрузка = Истина Тогда
			Возврат;
		КонецЕсли;
		
		Если РежимПроведения = РежимПроведенияДокумента.Неоперативный Тогда
			
			ПараметрыСмены = Новый Структура("ДатаСмены, Смена", ДатаСмены, Смена); 
			
			Дата = РфпСервер.ПолучитьДатуВремяПоВидуДокумента(ПараметрыСмены, ЭтотОбъект.Ссылка.Метаданные().Имя);
			
		КонецЕсли;   
		
		Если РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
			
			//Соберем массив для контроля остатков  
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|  алк_ОстаткиЗапасов.СерийныйНомер
			|ИЗ
			|  РегистрНакопления.алк_ОстаткиЗапасов КАК алк_ОстаткиЗапасов
			|ГДЕ
			|  алк_ОстаткиЗапасов.Регистратор = &Регистратор
			|  И НЕ алк_ОстаткиЗапасов.СерийныйНомер = ЗНАЧЕНИЕ(Справочник.СерийныеНомера.ПустаяСсылка)";
			
			Запрос.УстановитьПараметр("Регистратор", Ссылка);  
			РезультатЗапроса = Запрос.Выполнить();  
			Выборка = РезультатЗапроса.Выгрузить();
			
			МассивСНДоЗаписи = Выборка.ВыгрузитьКолонку("СерийныйНомер");
			
			ДополнительныеСвойства.Вставить("МассивСНДоЗаписи", МассивСНДоЗаписи);
			
		КонецЕсли;
		
		
	КонецПроцедуры
	
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	ЗаполнениеОбъектовУНФ.ЗаполнитьДокумент(ЭтотОбъект, ДанныеЗаполнения);
КонецПроцедуры

	#КонецОбласти
	
	Функция КонтрольДублей(РежимПроведения, ДополнительныеСвойства)
		
		Возврат Ложь;
		
		//Отказ = Ложь;
		//
		//Запрос = Новый Запрос;
		//Запрос.Текст = 
		//"ВЫБРАТЬ
		//|	алк_ПараметрыПакетов.СерийныйНомер,
		//|	СУММА(1) КАК Счетчик
		//|ПОМЕСТИТЬ втРезультат
		//|ИЗ
		//|	РегистрСведений.алк_ПараметрыПакетов КАК алк_ПараметрыПакетов
		//|ГДЕ
		//|	алк_ПараметрыПакетов.СерийныйНомер В(&СерийныйНомера)
		//|
		//|СГРУППИРОВАТЬ ПО
		//|	алк_ПараметрыПакетов.СерийныйНомер
		//|;
		//|
		//|////////////////////////////////////////////////////////////////////////////////
		//|ВЫБРАТЬ
		//|	втРезультат.СерийныйНомер,
		//|	втРезультат.Счетчик
		//|ИЗ
		//|	втРезультат КАК втРезультат
		//|ГДЕ
		//|	втРезультат.Счетчик > 1";
		//
		//Запрос.УстановитьПараметр("СерийныйНомера", ДополнительныеСвойства.ДляПроведения.Ссылка.СерийныеНомераПродукция.Выгрузить(, "СерийныйНомер"));
		//
		//РезультатЗапроса = Запрос.Выполнить(); // РезультатЗапроса.Выгрузить()
		//
		//Если Не РезультатЗапроса.Пустой() Тогда
		//	
		//	Отказ = Истина;
		//	
		//	Сообщение = Новый СообщениеПользователю;
		//	Сообщение.Текст = "Дублируются пакеты!";
		//	Сообщение.Сообщить(); 
		//	
		//КонецЕсли; 	
		//
		//Возврат Отказ;
		
	КонецФункции
	
	
#КонецЕсли


Процедура Конец()
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
		
	Для Каждого эл ИЗ Продукция Цикл 
		РегистрыСведений.алк_ДополнительныеПараметрыПакетов.УдалитьЗаписьВРегистре(ПолучитьСсылкуСН(эл.СерийныеНомера)[0].Ссылка,Ссылка);
	КонецЦикла;

КонецПроцедуры 

Функция ПолучитьСсылкуСН(Наименование)
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	СерийныеНомера.Ссылка
	               |ИЗ
	               |	Справочник.СерийныеНомера КАК СерийныеНомера
	               |ГДЕ
	               |	СерийныеНомера.Наименование ПОДОБНО &Наименование";
	
	Запрос.УстановитьПараметр("Наименование", Наименование);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции
